var app = new Vue({
    el: '#app',
    data: {
        student: {//因为 轮播时间间隔 轮播方式 等配置不由后端提供所以直接在这里写
            header: ['年级', '专科', '本科','硕士','合计'],
            data: [
                ['2010', '行7列2', '行7列3', '行1列3', '行1列3'],
                ['2011', '行8列2', '行8列3', '行1列3', '行1列3'],
                ['2012', '行9列2', '行9列3', '行1列3', '行1列3'],
                ['2013', '行0列2', '行1列3', '行1列3', '行1列3'],
                ['2014', '行1列2', '行1列3', '行1列3', '行1列3'],
                ['2015', '行2列2', '行2列3', '行1列3', '行1列3'],
                ['2016', '行3列2', '行3列3', '行1列3', '行1列3'],
                ['2017', '行4列2', '行4列3', '行1列3', '行1列3'],
                ['2018', '行5列2', '行5列3', '行1列3', '行1列3'],
                ['2019', '行6列2', '行6列3', '行1列3', '行1列3']
            ],
            headerBGC:'#99a7af',
            oddRowBGC:'#55a8da',//奇数行背景色
            evenRowBGC:'#8bcfea',//偶数行背景色
            align:['center','center','center','center','center'],
            waitTime: 4000,//轮播时间间隔
        },
        profession:{
            data: [
                {
                  name: '南阳',
                  value: 167
                },
                {
                  name: '周口',
                  value: 123
                },
                {
                  name: '漯河',
                  value: 98
                },
                {
                  name: '郑州',
                  value: 75
                },
                {
                  name: '西峡',
                  value: 66
                },
              ],
              unit: '人数',
              showValue: true
        }
    }
});
